{
    "name": "Lead Consultant",
    "email": "anirudhsingh.cdac@gmail.com",
    "mobile_number": "7838031888",
    "skills": [
        "Hive",
        "Aws",
        "Watchdog",
        "Editing",
        "Automation",
        "Itil",
        "Unix",
        "Hadoop",
        "Operations",
        "Kpi",
        "Security",
        "Debugging",
        "Sql",
        "Cisco",
        "Python",
        "Communication",
        "Hbase",
        "Installation",
        "Shell",
        "Solaris",
        "Redhat",
        "Cloud",
        "Zookeeper",
        "Mysql",
        "Sql server",
        "Technical",
        "Oracle",
        "Servers",
        "Technical skills",
        "Intranet",
        "Networking",
        "Routing",
        "Database",
        "Hardware",
        "Protocols",
        "Scripting",
        "Architecture",
        "Os",
        "System",
        "Docker",
        "Java",
        "Sap",
        "Video",
        "Jira",
        "Linux",
        "Ibm",
        "Dhcp",
        "Administration",
        "Commissioning",
        "Troubleshooting",
        "Transactions",
        "Testing",
        "Dns",
        "Yaml",
        "Ansible",
        "Access",
        "Vmware",
        "Windows"
    ],
    "college_name": null,
    "degree": null,
    "designation": null,
    "experience": [
        "in project.",
        "Monitoring and debugging HLS and RSTP stream. Performing UAT and UET testing. Monitoring traffic of Smooth Streaming",
        "(SS), HLS, and RTSP Traffic.",
        "Video Injection, Video Transcoding and Video Delivery. Monitoring and debugging HLS and RSTP stream. Monitoring traffic",
        "of Smooth Streaming (SS), HLS, and RTSP Traffic.",
        "Working on Docker and Kubernates, Splunk, Ansible and puppet tools. Transcoding, WON, PTS, Sumologic, Nagios, New Relic",
        "Automation , NPAW, Stash, Static Repackaging and Dynamic Repackaging, MediaBus.",
        "WebLogic,  Jenkins  and  CHL  Web  application  Deployment,  configuration  and  Integration,  Patching  and  upgrading",
        "WebLogic servers, Testing(UCT).Configuring domain, Configuring Admin/Node Manager, Configuring WLST JNDI",
        "JDBC,  Setting  up  JMS  Applications,  Managing  Transactions,  Securing  WLS  Resources  and  Applications  Managing  and",
        "troubleshooting  Clusters  and  Clustering  Services,  WLST  (Recording,  Editing  and  scaling  up  cluster).  Deployment,",
        "configuration and upgrading of AWS, IOT and XMPP Alarm delivery Kafka and zookeeper and relay servers. Implementation of",
        "Watchdog  and  Cube  Agent  installation.  Implementing,  deploying  and  configuring  New  Relic  and  graphite  tools  in  existing",
        "Environment. Implementing, deploying and configuring OBIEE, Splunk, Zookeeper, Kafka, and Kafka stream, relay servers and",
        "apache Solar in product. Installing, configuring JMS, JDBC, and Rabbit MQ. Bamboo CI/CD and Jenkins. Handling Oracle DB,",
        "AWS/Redhat Cloud, configuration management tools Puppet/ANSI and integrating Apache Solr with zookeeper. Providing",
        "SIP and risk registers. Installing, configuring and troubleshooting Apache Solar, Oracle WebLogic and Oracle ATG. Working on",
        "Docker and Docker compose and Kubernates, Splunk, Ansible and puppet tools.",
        "ACADEMIC PROFILE",
        "PGDSDA from CDAC-NOIDA obtained A+ grade",
        "MCA from V.B.S Purvanchal University in 2009.",
        "BCA from V.B.S Purvanchal University in 2006.",
        "SSC from St, Joseph’s Convent School (C.B.S.E) ShaktiNagar, (Distt) Sonebhadra, UP in 2003.",
        "HSC from St, Joseph’s Convent School (C.B.S.E) Shakti Nagar, (Dist) Sonebhadra, UP in 2001.",
        "CO U RS E  /  T RA IN I N G  AT T E ND E D",
        "Summer internship at N.T.P.C (National Thermal Power Corporation) Singrauli.",
        "Summer internship at Hindalco (Hindalco Power Division) Renusagar.",
        "AWARDS & ACHIEVEMENTS",
        "Scholarship Merit Certificate in 4 National IT Aptitude Test held by NIIT of 2007.",
        "Technical Events coordinator in Fest (Visage 2007).",
        "EXTRA-CURRICULAR ACTIVITIES",
        "Reading Novels, Watching Movies, listening to Music, Solving Sudoku Problems.",
        "DECLARATION",
        "I hereby declare that all the above-mentioned facts and information are true to the best of my knowledge. I shall be",
        "solely responsible for any discrepancy found in them.",
        "Date: 01/07/2020",
        "(Anirudh Singh)"
    ],
    "company_names": null,
    "no_of_pages": 6,
    "total_experience": 0.0
}