{
    "name": "• New",
    "email": "kumaranujofficial10@gmail.com",
    "mobile_number": "711-4116",
    "skills": [
        "Operations",
        "Pmp",
        "Vendors",
        "Documentation",
        "Engineering",
        "Procurement",
        "Construction",
        "Testing",
        "Scrum",
        "Purchase orders",
        "Sap",
        "Certification",
        "Communication",
        "Plan",
        "Payments",
        "Billing",
        "Technical",
        "Analysis"
    ],
    "college_name": null,
    "degree": [
        "Bachelor of Technology, Mechanical Engineering  \n\n      Bengaluru, India  \n              ",
        "Post Graduate Diploma In Management"
    ],
    "designation": null,
    "experience": [
        "GE T&D India Limited",
        "Turnkey Project Management Specialist",
        "UP, India",
        "Jul’17 – Present",
        "Led and developed the costs of all the project related activities based on the budgeted values. Proper booking and mapping",
        "of all the costs in EAS (Estimated Analysis Sheet) to maintain and report project margin.",
        "",
        "  Headed Project Billing to customer of the entire project.",
        "",
        "Ensured timely supply of onshore supply items to site to facilitate site progress. Managing the fund payments to vendors",
        "and transporters includes preparation of payment lists and resolving the entire invoice related issues with the vendors.",
        "Tools used- SAP",
        "  Analyzed and mitigated requirement based RFQs (Request for quotations) to the vendors, selection of vendors based on",
        "technical and commercial competence and ensuring optimum savings. Preparation of PAN (Purchase Authorization Note)",
        "and placing of Purchase Orders. Tools used- SPT & SAP",
        "  Managed cross-functional teams to realize payments from client by completion of documentation to meet cash target.",
        "  Oversaw quality inspections, engineering, and procurement, assisted construction teams at multi-locations.",
        "  On continuous close contact with customer aiming to inform the progress and work to defend the company main interest.",
        "",
        "Continuous  monitoring  by  carrying  out  weekly  meeting  to  control  projects,  check  progress,  manage  cost,  identify",
        "deviations from plan, detect risk and forecast future performance.",
        "  Demonstration of strong Follow-up and reduction of overdues in line with business objectives",
        "",
        "Ensured customer satisfaction through Effective and Healthy conversation",
        "Accenture Services Pvt. Limited",
        "Software Testing Engineer (Projects)",
        "Haryana, India",
        "Jul’15 – Jul’17",
        "  Rich accomplishment in Analysis, Client Interaction, Documentation and Quality Maintenance of Application Software.",
        "  Helped increase client satisfaction score by 20%",
        "",
        "",
        "",
        "Increased per day testing of test case scenarios by 35% by using various tools.",
        "Lead scrum calls and provided significant inputs during Sprint planning.",
        "Identify and implement resource allocation for smooth sailing of project."
    ],
    "company_names": [
        "Accenture Services Pvt. Limited  \n\nSoftware Testing",
        "GE T&D India Limited"
    ],
    "no_of_pages": 1,
    "total_experience": 0.0
}