{
    "name": "Mohit Kaushik",
    "email": "mohitkaushik645@gmail.com,",
    "mobile_number": "9971981881",
    "skills": [
        "Test cases",
        "R",
        "Tableau",
        "Automation",
        "Tfs",
        "Excel",
        "Sdlc",
        "Salesforce",
        "Selenium",
        "Sql",
        "Statistics",
        "Python",
        "Training",
        "Crm",
        "Hbase",
        "Hp alm",
        "Mining",
        "Shell",
        "Scrum",
        "Reporting",
        "Mobile",
        "Technical",
        "Oracle",
        "Apis",
        "Benchmarking",
        "Quality assurance",
        "Analytical",
        "Mechanical engineering",
        "Analytics",
        "Database",
        "Agile",
        "Api",
        "Engineering",
        "System",
        "Higher education",
        "Software development life cycle",
        "Java",
        "Jira",
        "Documentation",
        "Linux",
        "Anaconda",
        "E-commerce",
        "Transactions",
        "Testing",
        "Data analytics",
        "Analysis"
    ],
    "college_name": null,
    "degree": [
        "B-tech in Mechanical Engineering"
    ],
    "designation": null,
    "experience": [
        "Software Quality Assurance Engineer:",
        "Landis N Gyr",
        "Mar 2018 to Dec 2018",
        "Noida, India",
        "•  Analysed requirements from user-stories and epics and prepared Test Planning",
        "•  Conducted functional requirements grooming with Business Analyst and defect backlog",
        "document for implementation.",
        "sessions on JIRA.",
        "•  Set up and troubleshot test environment and prepared test data for testing.",
        "•  Tested designed software for advanced metering infrastructure and consistently",
        "communicated the findings and feedback in scrum meeting.",
        "•  Executed shell scripts to perform transactions and to modify test data.",
        "•  Deployment of beta built on the environments for the USA and Switzerland.",
        "•  Gave demos and sign-off documents to the Product owners and stakeholders of new",
        "incorporations in the product with test results and key findings with detailed",
        "documentation in accordance with FSD and BRD.",
        "•  Performed re-testing of resolved bugs and labelled test cases for regression cycle.",
        "•  Prioritized requirements as per the business logics and regularly took follow-up for the",
        "defect backlogs.",
        "•  Executed Functional testing, Regression Testing using selenium webdriver.",
        "•  Channelized the findings to team members in the scrum meeting or retrospectives",
        "meetings to understand the root cause and update on the progress of the user stories.",
        "Test Analyst:",
        "Indiamart",
        "July 2017 to Mar 2018",
        "Noida, India",
        "•  Responsible for testing the functionalities across all the platforms (Desktop, mobile site,",
        "Apps).",
        "•  Documented test planning and prepared Test cases for the upcoming requirements."
    ],
    "company_names": null,
    "no_of_pages": 2,
    "total_experience": 1.42
}