{
    "name": "PROFESSIONAL EXPERIENCE",
    "email": "muazzamhasan@",
    "mobile_number": "8459779614",
    "skills": [
        "Compliance",
        "Drafting",
        "Audit",
        "Email",
        "Governance",
        "Process",
        "English",
        "Conversion",
        "Excel",
        "Tax",
        "International",
        "Ms excel",
        "C",
        "Mobile",
        "Filing",
        "Word"
    ],
    "college_name": null,
    "degree": null,
    "designation": null,
    "experience": [
        "Working as an Associate (from July, 2019 to till date)",
        "M/s.  Yogakshem  Insolvency  Professionals  LLP,  Insolvency  Professionals  Entity  at  Tilak",
        "Nagar, New Delhi, from July, 2019 t o till date.",
        "M/s.  Yogakshem  Insolvency  Professional  LLP  (Regd.  No.  IBBI/IPE/0010)-An  Insolvency",
        "Professional Entity under Insolvency and Bankruptcy Board of India (IBBI).",
        "Work Profile:",
        "•  Ensuring  compliances  with  regards  to  Insolvency  and  Bankruptcy  Code’2016  and",
        "relevant laws there under.",
        "•  Preparation of Notice & Agenda, Minutes of Committee of Creditors meeting, Reply",
        "Letters for stakeholders and other various relevant documents.",
        "•  Assist to Resolution Professional for the conduct of Corporate Insolvency Resolution",
        "Process and Liquidation of company as per Indian companies’ laws.",
        "•",
        "Preparation & up-gradation of Claim Register and Information Memorandum.",
        "•  Preparation and filing of petition, affidavit, reply, and status report before Hon’ble",
        "National Company Law Tribunal.",
        "•  Ensure  compliance  related  to  Public  Announcement,  intimations  to  stakeholders,",
        "Verification of Claims, Inspection of books of accounts, Filing of NCLT order to ROC",
        "(INC-28) and Abide with strict timelines as mentioned in Insolvency and Bankruptcy",
        "Code and relevant laws there under.",
        "•  Due diligence of Resolution Applicant, Corporate Debtor and other related entities.",
        "•  Conduct e-voting of the meeting and issue final results of the e-voting.",
        "Worked as Assistant to Company Secretary (from July, 2018 to June, 2019)",
        "M/s. Parveen Rastogi & Co., Company Secretaries firm at Pahar Ganj, New Delhi.",
        "Work Profile:",
        "•",
        "Incorporation  of  Company;  Conversion  of  Company  into  LLP;  Conversion  of  Public",
        "Co. into Private Co.",
        "•  Alteration  of  Memorandum  and  Articles  of  Association    &  Increase  in  Authorized",
        "Share Capital of Company",
        "•  Change of Registered Office of LLP from One State to another State",
        "•  Private Placement of Shares of Private limited Company",
        "•  Annual Filing including XBRL Filing of Private/Public Companies",
        "•  Preparation of Statutory Registers, Share Certificates and Share Transfer Deeds",
        "•",
        "•  Drafting of Resolutions & Minutes of the Companies",
        "•  Drafting of Annual Report of Listed Companies",
        "•  Secretarial Audit of the Companies",
        "•  Online  Stamp  Duty  Payment  on  Incorporation  and  Issuance  of  Shares  through",
        "Issuance of Duplicate Share Certificates",
        "Private Placement, Right Issue.",
        "CS. MUAZZAM HASAN",
        "(ACS, M.Com, PGDIBO)",
        "Contacts:",
        "Mobile:",
        "+91-8459779614,",
        "9654500640",
        "Email id:",
        "muazzamhasan@",
        "gmail.com",
        "Address:",
        "T-20, Street No. 7,",
        "Gautampuri,",
        "Delhi-110053",
        "Experience:",
        "2 years",
        "Languages:",
        "English & Hindi",
        "Hobbies:",
        "Listening Music",
        "and Flying Kites",
        "Strength:",
        "Good learner,",
        "Confidence &",
        "Hardworking",
        "•  Quarterly/Semi-Annually/  Annual  and  event  based  compliances  of",
        "listed",
        "Companies, listed on BSE & NSE under SEBI (LODR), 2015 and SEBI Takeover Code’",
        "2011.",
        "Exposure related to Corporate Restructuring:",
        "(cid:1)  Takeover of Sole Proprietorship Firm by the Private Company.",
        "(cid:1)  Amalgamation",
        "Public",
        "Companies",
        "Private",
        "into",
        "of",
        "Limited",
        "Company.",
        "Worked in Listed Company as Management Trainee",
        "National Fertilizers Limited",
        "Management Trainee",
        "Sec -24, Noida.",
        "6th April, 2017 to 5th July, 2018 (15 Months)",
        "Worked  15  Months  as  a  Management  Trainee  in  National  Fertilizers  Limited(NFL),  NFL  is",
        "India’s  leading  Fertilizer  Company,    a  Government  of  India  Undertaking,  Mini  Ratna",
        "(Category-I) Company, listed on BSE and NSE.",
        "Roles and Responsibilities during Internship:",
        "●  Preparation of Annual Report including Board Report, Corporate Governance Report",
        "and Notice of the Annual General Meeting.",
        "●  Quarterly,  Half  yearly  Listing  Compliances  and  regular  event  based  compliances",
        "requirement of the SEBI (LODR) Regulation, 2015.",
        "●  Drafting of Notes, Stock Exchange Letters, Notice of Board Meeting etc.",
        "●  Preparation of registers required as per Companies Act, 2013.",
        "●  Drafting of work orders as prepared to assign the work to various agencies.",
        "●  Assisted in  Organizing  and  maintaining  the  share  department  of  the  Company  like",
        "Transfer, Consolidation, sub-division of shares and issuance of share certificate.",
        "●  Assisted  in  Convening  AGM  of  the  Company  and  ensuring  all  the  compliances",
        "thereto.",
        "COMPUTER",
        "KNOWLEDGE:",
        "Well versed with:",
        "•  MS-Office",
        "(MS  Excel,  MS",
        "Word,  MS  Power",
        "Point).",
        "●  Internet  and",
        "versed",
        "well",
        "of",
        "knowledge",
        "sites  (MCA,  BSE,",
        "NSE,  SHCIL,  SEBI",
        "and",
        "INCOME",
        "TAX)",
        "Professional/Educational",
        "Qualification",
        "C S",
        "M.Com (International Business)",
        "PGDIBO (Post Graduation",
        "Diploma in   International",
        "Business)",
        "B.com (Pass)",
        "ACADEMIC CREDENTIALS",
        "Year",
        "Marks",
        "(%)",
        "Institute/ University",
        "June’17",
        "50.30 %",
        "2018",
        "60.28%",
        "2016",
        "60.5 %",
        "2014",
        "50.22%",
        "The Institute of Company Secretaries of",
        "India",
        "Indira Gandhi National Open University",
        "Indira Gandhi National Open University",
        "University of Delhi",
        "I hereby declare that whatever furnished above is true, correct and complete to the best of",
        "my knowledge.”",
        "Date:",
        "Place: Delhi",
        "(Muazzam Hasan)"
    ],
    "company_names": null,
    "no_of_pages": 2,
    "total_experience": 0.0
}