{
    "name": "NIKITA GUPTA",
    "email": "n.nikitagupta.g@gmail.com",
    "mobile_number": "8057946821",
    "skills": [
        "Compliance",
        "Marketing",
        "P",
        "Regulatory",
        "Regulations",
        "Consulting",
        "Audit",
        "Governance",
        "Reporting",
        "Excel",
        "Pattern",
        "Erp",
        "C",
        "Powerpoint",
        "Filing",
        "Word"
    ],
    "college_name": null,
    "degree": null,
    "designation": [
        "Pashupati Polytex"
    ],
    "experience": [
        "Pashupati Polytex (P) Ltd                                                                                   Kashipur",
        "Company Secretary",
        "16th April, 2019- Present",
        "  Filing of various forms with ROC under new Companies  Act;",
        "  Preparation of minutes of Board, its committees and members meeting;",
        "  Maintenance of Statutory Registers;",
        "  Preparation and vetting of various agreements  including consulting agreements, Joint venture",
        "agreements, vendor Agreement, MOU, Non- Disclosure Agreement, Shareholders Agreement,",
        "etc;",
        "  Handled  compliances  related  to  EPR  obligations  for  recycling  company  under  Plastic  Waste",
        "Management Rules, 2016;",
        "  Vetting of accounts and financials of  company.",
        "M/s Siddarth Agarwal & Co                                                                                       Noida",
        "Senior Associate",
        "19th February, 2018-15th March, 2019",
        "  Handled Private Placement issues and its compliances under Companies  Act;",
        "",
        "Incorporation of  Companies;",
        "  Preparation & filing of ITR returns;",
        "  Preparation of articles on various topics under Corporate and taxation laws.",
        "M/s Kriti Advisory Services Private Limited (KAS)                     Kaushambi,Ghaziabad",
        "Manager",
        "25th January 2017 - 10th February, 2018",
        "  Handled  and  prepared  the  various  charges  documents  and  its  compliances  of  the  Financial",
        "Service company  BARCLAYS;",
        "  Handled allotment of shares and payment of Stamp Duty thereon;",
        "  Conducted  Secretarial  Audit for various  infrastructure,  listed  and  Real  Estate  Companies",
        "including  GMR Group, C & C Constructions Limited, Sterling Tools Limited, Rapid Metro Rail",
        "Gurgaon Limited and its group Companies, etc);",
        "  Preparation of Search  Report;",
        "  Handled day to day Statutory  compliances  of listed and   unlisted  Companies;",
        "  Preparation  and  filing  of  Statutory  documents  viz.  Board  Report,  annual  return  etc  for  both",
        "listed and unlisted Companies;",
        "  Handled E-Voting and Preparation of Consolidated Scrutinizer Report for E‐ Voting and Postal",
        "Ballot;",
        "  Reporting of Financials in XBRL of listed and unlisted companies;",
        "  Handled annual and other compliances of LLPs;",
        "  Conducted SEBI Audits of RTA under LODR Regulations, 2015;",
        "  Preparation and Submission of Corporate Governance report, Shareholding pattern etc under",
        "Listing guidelines;",
        "  Preparation of Trademark Application and submission of Replies pursuant to the  Objections;",
        "  Compliance  under  FEMA  1999  with  respect  to  foreign  remittances  including  allotment  of",
        "shares."
    ],
    "company_names": null,
    "no_of_pages": 2,
    "total_experience": 0.0
}