{
    "name": "of Rajasthan",
    "email": "cspushprajyadav@gmail.com",
    "mobile_number": "9694324040",
    "skills": [
        "Governance",
        "Audit",
        "Filing",
        "Transactions",
        "International",
        "Partnership",
        "Compliance",
        "Legal",
        "English",
        "Drafting",
        "Training",
        "Communication",
        "Partnerships",
        "Reports",
        "Regulations",
        "Presentation",
        "Conversion",
        "Tax"
    ],
    "college_name": null,
    "degree": null,
    "designation": null,
    "experience": [
        "M/s Malhotra Arora & Associates, Gurugram-Haryana.",
        "Details of Key assignments handled/assisted",
        "Period (25th September, 2019 to 25th September, 2020)",
        "Under Companies Act,2013",
        "Prepration and filing of XBRL Returns.",
        "Drafting of various Agreements, deeds including but not limited to Franchise agreements,",
        "Rent Agreements, Partnership Deed, Business Agreements, Agency Agreements,",
        "Affidavits & No-Objection Certificates (NOCs).",
        "Preparation of Board Report and Annual Reports of various Companies.",
        "Shifting of Registered office Both Inter and Intra State.",
        "Compliance Relating to Foregin Investments and filing thereof with RBI.",
        "Convening and conducting Board/Annual General Meetings;",
        "Preparation & Drafting of Statutory Registers, Notices, Agenda,Board Resolution, Forma",
        "& Returns, Minutes and Resolutions of Board, ACM, NRC, CSR, SRC, and General",
        "Meetings;",
        "Drafting of Reply of RD, ROC, NSE, BSE, NSDL, CDSL and various authorities’ notices;",
        "Performed Secretarial Audit of various listed and MNC’s companies;",
        "Filing of various Applications for Condonation of Delay.",
        "Prepared various Search Reports and Due Diligence Reports;",
        "Handled the quarterly, half yearly, annual and event based compliances and disclos-",
        "ures as per Regulations;",
        "Review, Preparation and drafting of Annual Report of Listed Company, Unlisted",
        "Public & Private Company including Notice, Director’s Report along with all its",
        "annexure;",
        "Other compliances related to companies Act, 2013 inter-alia Right Issue, Strike Off,",
        "Conversion of Companies, Appointment & Cessation, Modification/Creation and",
        "Satisfaction of Charges.",
        "Assisted in issue and allotment of Equity Shares including right issue and under Private",
        "placement.",
        "Increase in Authorized and Paid up Share Capital of the Company;",
        "Handling shareholder cases including Issue of Duplicate share certificates, Preparation of",
        "Share Transfer Deeds and Share Certificate.",
        "Monitoring and Analyzing the transactions of Inter – Corporate Loans/ advances and",
        "Investments and Related Party Transactions under of the Companies Act, 2013;",
        "Alteration of Memorandum and Articles of Association",
        "Appointment and Remuneration of Directors, KMP and Auditors under the Companies",
        "Act, 2013;",
        "Obtaining ISIN and Complete Procedure of Dematerialization.",
        "Incorporation of Company and Limited Liability Partnerships (LLPs) and Drafting of",
        "various documents, replies relating to it;",
        "Registration of Trademarks (Wordmark, Device etc.) with the Trademark Registry",
        "and Drafting of replies to the Show Cause Notices issued by Trademark authorities;",
        "FIRM Registration, TAN & PAN Application, Udyam Registration, share stamping, FSSAI",
        "Registration, Shop and establishment Registration, p.f. and Esic Registration.",
        "Also Having Knowledge of Taxation(Direct and Indirect Tax) and compliances thereof ;",
        "AWARDS & HONOURS",
        "During",
        "College",
        "During",
        "cs Classes",
        "During",
        "Trainig",
        "Honoured with the award of “ACADEMIC EXCELLANCE” of Parishkar",
        "International college for securing 3rd Rank in B.COM;",
        "Honoured with the award of “EXCELLENCE” of Chinmay Tutorials",
        "for winner in Power Point Presentation and quiz Competition.",
        "Honoured with the “Certificate Of Excellence” on completion of CS",
        "Training.",
        "PERSONAL CATALOGUE",
        "Date of Birth",
        "Nationality",
        "Father’s Name",
        "Mother’s Name",
        "Areas of Interest",
        "Marital Status",
        "Languages Known",
        ":",
        ":",
        ":",
        ":",
        ":",
        ":",
        ":",
        "May 29, 1998",
        "Indian",
        "Mr. Mahender Singh Yadav",
        "Mrs. Rajbala Yadav",
        "Corporate Law, Compliance, Secretarial, Legal,",
        "Taxation",
        "Unmarried",
        "English and Hindi",
        "I hereby declare that information furnished above is true and correct to the best of my",
        "knowledge and belief.",
        "Thanks for your time and consideration.",
        "BEST REGARDS",
        "PUSHPRAJ YADAV"
    ],
    "company_names": null,
    "no_of_pages": 3,
    "total_experience": 0.0
}