{
    "name": "RISHABH SETHI",
    "email": "sethi.rishabh02@gmail.com",
    "mobile_number": "8587820572",
    "skills": [
        "Compliance",
        "Presentation",
        "Tableau",
        "Excel",
        "C",
        "Pattern",
        "Training",
        "Communication",
        "Drafting",
        "Regulations",
        "English",
        "Legal",
        "Policies",
        "Queries",
        "Purchase orders",
        "Audit",
        "Filing",
        "Technical",
        "Technical skills",
        "Reports",
        "Architecture",
        "Powerpoint",
        "Finance",
        "Reconciliation",
        "Governance",
        "Analysis",
        "Merchant",
        "Ecommerce"
    ],
    "college_name": null,
    "degree": null,
    "designation": null,
    "experience": [
        "Trainee in UK based MNC, Xchanging Solutions Limited (Listed Entity), Gurgaon",
        "Major Assignments:",
        "•      Assisted in preparation of documents for Delisting (As per Delisting Regulations 2009)",
        "further assisted in Postal Ballot.",
        "•      Prepared the documents for Inter se Promoter Transfer as per SEBI (SAST) Regulations",
        "•  Prepared and filed the documents for Capital Reduction pursuant to scheme of clause 24f of the Listing",
        "Agreement now SEBI Listing Regulations 2015",
        "•  Prepared  documents  and  assisted  in  filing      of  petition  to  the  Company  Law  Board  for  availing",
        "•",
        "exemption for Change of Financial Year for the Xchanging Group Entities.",
        "Prepared  documents  for  Due  Diligence  Certificate  from  Merchant  Banker  essentially  required  for",
        "Delisting.",
        "•     Preferential allotment of shares of Indian Company to Foreign Company as per the",
        "Companies Act, 2013 and FEMA provisions.",
        "Listed Compliances:",
        "•",
        "Preparation of Annual Report including Corporate Governance Report, Management & Discussion",
        "Analysis, CSR Report, etc.",
        "•  Filling  of  Financial  Results,  Shareholding  Pattern,  Share  Reconciliation  Audit  Report  Investor",
        "Grievance  Statement,  Half  Yearly  Compliance  Certificate,  Certificate  under  Regulation  7(2)  of  SEBI",
        "Listing Regulation 2015.",
        "•   Filling of Promoters shareholding as per clause 29 & 30 of the SEBI Takeover Code.",
        "•   Handling Shareholding grievances and filing other statutory disclosures.",
        "•   Other regular Listing Compliances pertaining to disclosures under SEBI Takeover code.",
        "RBI & FEMA Assignments:",
        "•   Prepared and filed FCTRS form for transfer of share from resident company to Foreign Company.",
        "•   Prepared and filed AFLA (Annual Return on Foreign Liabilities and Assets) with RBI.",
        "•   Prepared documents for obtaining Legal Entity Identifier Number as required by RBI.",
        "•   Prepared and filed FC-GPR with RBI for allotment of shares of Indian Company to Foreign Company.",
        "Secretarial Assignments:",
        "•   Handling the entire gamut of secretarial tasks of Group Entities.",
        "•   Drafting of Minutes of Board and Committee Meetings, preparation of pre and post meetings documents.",
        "•  Filing of various statutory forms, Balance Sheet, Profit & Loss A/c & Annual Returns with",
        "Ministry of Corporate Affairs (MCA).",
        "•   Made various policies as per Companies Act, 2013",
        "•   Drafting notices, agenda and other documents required for convening Board Meeting (s), Annual General",
        "Meeting and Committee Meeting of the Group Companies",
        "•     Prepared various Statutory Registers required to be maintained under the Companies",
        "Act, 2013.",
        "•",
        "Handled  Charge  related  matters:  -  Creation  and  Modification  of  Charges,  Creation  of  Charge  Ids,",
        "Availing  NOC  from  the  Bank  and  Satisfaction  of  Charge  and  filed  Form  CHG-4  and  CHG-1  for  the",
        "registration of Charge and Satisfaction of Charge respectively.",
        "•  Prepared and file documents for obtaining Importer Exporter Code from Director General of Foreign",
        "Trade",
        "•      Preparation of Project Reports for STPI Renewal Licenses",
        "•  Preparation of documents for share transfers, Liasoning with RTA for issuance of duplicate certificates",
        "and handling investor queries.",
        "Accounts & Finance:",
        "Invoice Processing, creation of Purchase Orders on Xpro Tool, Raising Purchase Requistion",
        "Templates",
        "Educational Qualification",
        "•     Passed Professional Programme of Institute of Company Secretaries of India (ICSI)",
        "In August, 2017.",
        "•      Passed Bachelors of Commerce from Lucknow Christian Degree College affiliated to",
        "Lucknow University in 2013,",
        "•  Passed Indian School Certificate (ISC) examination from Stella Maris Convent School, Lucknow in 2010",
        "with 81%",
        "•      Passed Indian Certificate Secondary Examination (ICSE) from Stella Maris Convent",
        "School Lucknow in 2008 with 85%."
    ],
    "company_names": null,
    "no_of_pages": 3,
    "total_experience": 0.0
}