{
    "name": "SANJEEV KUMAR",
    "email": "to.sanjeevkumar@gmail.com",
    "mobile_number": "9971281766",
    "skills": [
        "Distribution",
        "User stories",
        "Operations",
        "Travel",
        "Coding",
        "C",
        "Training",
        "Communication",
        "Banking",
        "Scrum",
        "Queries",
        "Schedule",
        "Mobile",
        "Technical",
        "Analytical",
        "Agile",
        "Supervising",
        "Finance",
        "Troubleshooting",
        "Testing",
        "Lifecycle",
        "Analysis",
        "Money",
        "Design"
    ],
    "college_name": null,
    "degree": null,
    "designation": null,
    "experience": [
        "technology domain and the specific work underway.",
        "● Focus on technology domain training and scope of work familiarization.",
        "● Overseeing the development of application in an Agile Environment.",
        "● Develop technical documents, templates, checklists, tools and training initiatives.",
        "● Role involves resource planning and deployment management.",
        "Tumlare- Associate Team Lead (Aug 2012 -June 2013)",
        "● Conduct interviews for potential new additions to the project team",
        "● Troubleshooting and testing the product making logs of steps to regenerate the issues.",
        "● Supported other teams in the organization through knowledge transfer wherever they needed it for  developing",
        "products",
        "● Worked with external and internal stakeholders to meet the requirements.",
        "Xavient- Module Lead (Aug 2007 - July 2012)",
        "● Leading a team of developers for development of the Techportal application.",
        "● Involved in Server Side development as well as on Client Side Interfaces.",
        "● Worked on multiple modules and completed under the assigned time frame.",
        "● Involved in end-end software processes including analysis, design, coding and unit testing",
        "● Worked with external and internal stakeholders to meet the requirements.",
        "● Propose review & execute design changes in both Gui and core processing elements.",
        "Tekege- Programmer (Oct 2006 – July 2007)",
        "● Involved in development and deployment of applications.",
        "● Integrated payment gateway Authorize.net",
        "● Monitoring the operations of the product like log monitoring, customer payment verification.",
        "ED U C AT ION",
        "● MCA from Deepshikha College (Rajasthan University) in 2006",
        "Name: Sanjeev Kumar",
        "Mobile: 9971281766"
    ],
    "company_names": null,
    "no_of_pages": 2,
    "total_experience": 6.5
}