{
    "name": "DevOps Engineer",
    "email": "sawarmalgupta1@gmail.com",
    "mobile_number": "7700873863",
    "skills": [
        "Lifecycle",
        "English",
        "Jira",
        "Unix",
        "Java",
        "Troubleshooting",
        "Presentation",
        "Transactions",
        "Process",
        "Finance",
        "Engineering",
        "Electrical",
        "Docker",
        "Automation",
        "Migration",
        "Electronics",
        "Windows",
        "Requests",
        "Scripting",
        "Administration",
        "Analysis",
        "Design",
        "Access",
        "Github",
        "Testing",
        "Cloud",
        "Email",
        "Shell",
        "System",
        "Software development life cycle",
        "Operations",
        "Sdlc",
        "Linux",
        "Aws",
        "Billing",
        "Servers",
        "Daily operations"
    ],
    "college_name": null,
    "degree": null,
    "designation": null,
    "experience": [
        "management client tools like CVS, Stash, Git and other command line applications etc.",
        "•  Extensively worked on continuous integration tool like Hudson, Jenkins and for end-to-end automation",
        "of various build and deployments.",
        "•  Work closely with system Engineers, QA, business and other teams to ensure automated test efforts are",
        "tightly integrated with the build system and then test results of various functionalities are sent to the",
        "team after running automated tests on newly deployed code.",
        "•  Excellent Knowledge of Application Lifecycle Management, Change & Release Management process.",
        "•  Exposed to all aspects of software development life cycle (SDLC) such as analysis, planning, developing,",
        "testing, implementing and post-production analysis of the projects.",
        "•",
        "I am responsible for modifying and tuning existing scripts.",
        "•  Worked on branching, merging and resolving merging conflicts.",
        "•  Setting up Jenkins jobs and configured slaves to Jenkins to run multiples builds",
        "•  Created branches for different teams and merged the branches periodically and according to requests",
        "from dev teams.",
        "•  Responsible for patch and load builds.",
        "•  Done deployments to multiple environments using puppet",
        "•  Reduce the burden of loads on single server by distributing the loads on different server using master",
        "slave concept.",
        "•  Generate report and send an email to managers about status of builds.",
        "•  Manage branching, merging and releasing activities for the engineering applications and libraries that",
        "make up our large service-oriented platform.",
        "•  Responsible to patch builds, daily builds, weekly builds and resolving issues related to build failure.",
        "•  Automating build and release activities using shell scripting.",
        "•  Source code branching strategies and methodologies for development and releases.",
        "•  Managing automation for customer access permission on git servers.",
        "•  Design, implement, and maintain continuous build and deployment mechanisms.",
        "•  Managing build infrastructures environment setups and monitoring daily operations in Jenkins and",
        "enhancing/troubleshoot issues/problems.",
        "•",
        "Identifying and driving automation of tasks associated with continuous integration and release",
        "process",
        "•  Revamping for existing build configuration to easily manageable and user friendly for automation.",
        "STRENGTHS",
        "•  Good Oral, written and presentation skills.",
        "•  A high tolerance of stress and enjoys responsibilities.",
        "•  Lead and work as a team in organized way.",
        "•  Action oriented and result focused."
    ],
    "company_names": null,
    "no_of_pages": 4,
    "total_experience": 0.0
}