{
    "name": "ShishuPal Sharma",
    "email": "Email:-sharmakkr9@gmail.com",
    "mobile_number": "8287840510",
    "skills": [
        "Marketing",
        "Javascript",
        "Mysql",
        ".net",
        "Test plans",
        "Compliance",
        "English",
        "Jira",
        "Java",
        "Quality standards",
        "Reports",
        "Content",
        "Technical",
        "Json",
        "Process",
        "Test cases",
        "Finance",
        "Jsp",
        "Oracle",
        "Docker",
        "Html",
        "Sh",
        "Css",
        "Windows",
        "Requests",
        "Analysis",
        "Design",
        "Specifications",
        "Statistics",
        "Programming",
        "Protocols",
        "Writing",
        "Testing",
        "Database",
        "Hadoop",
        "Website",
        "Product development",
        "Cloud",
        "Rest",
        "Hardware",
        "System",
        "Sql",
        "Android",
        "Js",
        "International",
        "Debugging",
        "Operations",
        "Xml",
        "Security",
        "Sdlc",
        "Telecom",
        "Linux",
        "Salesforce",
        "Mobile",
        "Presentations",
        "Architecture",
        "Coding",
        "Servers"
    ],
    "college_name": null,
    "degree": null,
    "designation": [
        "Senior Associate undertaking the following:-  Worked on the creating the Quartz Scheduler to move the data.  Created Spring boot application to Sync the data from one DB to another.  Responsible for Deployment to the Amex cloud Environment.  Responsible for coding user interfaces using JSP, query, Ajax. Responsible for coding of DAO classes using spring with hibernate. Coordinated with the QA team for testing and resolved the reported bugs. Writing Test cases using customized JUnit Framework.  System and Integration testing Bug Fixing. Worked independently on the projects/enhancements with minimal supervision. Title: FDP Airtel DRC Client: -  Airtel DRC Team Size: 8 Duration: Jan 2016 to Jun 2018 Language/Database: Jdk1.7, Core Java, JSP, Spring 3.2 MVC, IOC, AOP, Security, Integration, JPA, Rest Web Service, XML, JMS, Multithreading, Concurrency, Junit, Mockito, Log4J, Apache Camel, Active MQ, EHCache, Jquery, Java Script, Jboss EAP 6.2 Project Description: - FDP (Feature Delivery Platform) solution allows operators to attain high level of ease while launching new business promotions, marketing products for prepaid segments around Charging System. FDP offers subscription channels USSD, SMS and open HTTP based API(s) using which subscribers can buy the products.  FDP will be integrated with Ericsson Charging system and Airtel Zambia USSD gateway  Tasks Handled:-",
        "Technical Lead"
    ],
    "experience": [],
    "company_names": [
        "Infogain India Pvt. Ltd."
    ],
    "no_of_pages": null,
    "total_experience": 0.0
}