{
    "name": "SMRITI SINGH",
    "email": "smritisuhana1995@gmail.com",
    "mobile_number": "8210311653",
    "skills": [
        "Staffing",
        "Contracts",
        "Website",
        "Immigration",
        "Writing",
        "Database",
        "Mis",
        "Process",
        "Employee engagement",
        "Operations",
        "Requests",
        "Engagement",
        "Payroll",
        "Queries",
        "Human resources",
        "Vendors",
        "Recruitment"
    ],
    "college_name": null,
    "degree": null,
    "designation": null,
    "experience": [
        "Apr 2018",
        "Aug 2019",
        "Human Resources Executive- Operations & ER",
        "Kochar Infotech Limited, Gurgaon",
        "Joining formalities and sending welcome emails to new employees.",
        "• Handling employee database (both in soft form and files management) in",
        "HRMS.",
        "• Taking care of Induction and onboarding of new employees.",
        "• Coordination with bank for salary account opening.",
        "• Generating ESI cards from ESI official website and providing to the",
        "employees",
        "• Generating UAN number coordinating with Payroll team and provide the",
        "details of PF deductions to the employees.",
        "• Coordinating with Vendors for employee’s Mediclaim cards.",
        "• Providing offer letter, Appointment letter, Confirmation letter and other",
        "related papers to employees.",
        "• Updating employee records with holiday requests, payroll changes and",
        "any leave due to illness.",
        "• Announcement of IJP and coordinating with mangers for internal",
        "movements of employees.",
        "• Managing daily headcount report, Attrition report and resignation report.",
        "• Leave & Attendance management.",
        "• Birthday and festival celebrations.",
        "• Managing salary and arranging salary help desk every month.",
        "• Taking One-O-One sessions with employees and uploading the feedback",
        "in company’s HRMS.",
        "• Motivate employees on day-to-day basis.",
        "• Exit-interviews, formalities & Full and final of employee",
        "Sep 2019",
        "Till",
        "Present",
        "HR Onboarding Specialist-US Staffing",
        "Acro Service Corporation(ACRO Hr Solution LTD)",
        "• Manage onboarding process for new starters.",
        "• Obtain information from candidates using company forms.",
        "• Customize and send offer packages, including their offer letter and the",
        "necessary client specific documents.",
        "• Conducting background checks and initiating drug screens according to",
        "client’s requirement.",
        "• Completing I-9 forms and e-Verify for new starters.",
        "• Accurately inputting candidate's details into online systems and creating",
        "personnel folders in order to complete onboarding process.",
        "• Following up with new hires and recruiters on the required paperwork",
        "needed to start on their assignment.",
        "• Answering new hire’s questions and assisting with general onboarding",
        "questions.",
        "• Managing to tight timelines in a fast-paced environment.",
        "• Verifications of employments (written and verbal VOEs, in addition to",
        "immigration verification letters).",
        "• Filling and ongoing maintenance of electronic personnel records/",
        "Responsible for MIS report generation.",
        "• Provide support to the US HR Manager",
        "• Handling contractor’s calls and understanding and resolving their queries."
    ],
    "company_names": null,
    "no_of_pages": 1,
    "total_experience": 0.0
}